<template>
<div class="rule-modal" :class="{'active':open}">
  <div class="blur" @click="close()"></div>
  <div class="rule-content">
    <h3>活動辦法
      <a class="close" @click="close()"><img src="img/bt_close.png"></a>
    </h3>
    <VuePerfectScrollbar class="scroll-area" v-once :settings="settings" @ps-scroll-y="scrollHanle">
      <h4>【活動期間】</h4>
      <p>2018/7/4 ~ 2018/08/3 中午12:00為止（活動時間以台灣標準時間(格林威治GMT+8)為準）。</p>

      <h4>【活動說明】</h4>
      <p>凡於活動期間至哈根達斯【桃憩夏日 樂響歌單】活動網站，依照指示即可參加【桃憩夏日 樂響歌單】抽獎活動（以下稱「本活動」），有機會抽中柯夢波丹夏日派對入場券乙組（含兩張）、哈根達斯夏日新品冰淇淋單球兌換券（白桃覆盆子或黃桃優格二選一）、friDay音樂90天無限暢聽服務序號乙組、蜜桃凍飲系列買1送1優惠券乙張、巴菲系列折價50元優惠券乙張。</p>

      <h4>【活動贈品】</h4>
      <ul>

        <li>抽獎贈品1：柯夢波丹夏日派對入場券乙組（含兩張，共50組）</li>
        <li>抽獎贈品2：哈根達斯夏日新品冰淇淋單球兌換券（白桃覆盆子或黃桃優格二選一）（共4,000份）</li>
        <li>抽獎贈品3：friDay音樂90天無限暢聽服務序號乙組（共100份）</li>
        <li>抽獎贈品4：哈根達斯門市蜜桃凍飲系列買1送1優惠券乙張（800份）</li>
        <li>抽獎贈品5：哈根達斯門市巴菲系列折價50元優惠券乙張（2,000份）</li>
      </ul>

      <h4>【中獎方式】</h4>
      <p>參與活動後可立即得知是否中獎</p>

      <h4>【抽獎資格】</h4>
      <ul>
        <li>參加人需依指示於活動期限內填寫完整資料才算完成抽獎手續</li>
        <li>每個（支）手機號碼每天僅有一次抽獎機會</li>


      </ul>


      <h4>【領獎流程】</h4>
      <p>
        抽獎贈品1：柯夢波丹夏日派對入場券
        <br/> 參與活動並經抽獎中獎，須完整輸入寄送資料，即可獲得柯夢波丹夏日派對入場券一組(含2張)，獎品將統一於[2018/7/11]寄出，如於2018/7/18仍未收到獎品，請向哈根達斯粉絲團聯繫。（夏日派對活動時間為7/21）
        <br/>
        <br/> ※限量50組。

        <br/> ※將統一於[2018/7/11]寄出
        <br/> ※若未於夏日派對活動當日前往夏日派對，恕不更換或補發其他贈品。
        <br/>
        <br/> 抽獎贈品2：哈根達斯夏日新品冰淇淋單球兌換券（白桃覆盆子或黃桃優格二選一）

        <br/> 參與活動並經抽獎中獎，即獲得中獎通知簡訊。中獎人須前往哈根達斯門市，點擊簡訊中所附的連結，並依據頁面中的指示，輸入手機號碼，成功驗證後由門市人員點擊確認鍵，即可兌換。（兌換時間至2018/08/10止）
        <br/>
        <br/> ※限量4000份。

        <br/> ※請勿封鎖或過濾垃圾簡訊，簡訊是否發送成功以簡訊發送公司後台為準，將不重新發送且不以其他形式重新提供兌換網址。
        <br/> ※每一簡訊限兌換乙次，若遺失、刪除簡訊恕不補發。
        <br/> ※本活動限兌換白桃覆盆子或黃桃優格冰淇淋口味。(二選一)
        <br/> ※內用冰淇淋需加收以該口味原價計算之10%服務費。
        <br/> ※圖片僅供參考，產品以現場供應為主。
        <br/> ※本活動恕不與哈根達斯禮券或其他優惠合併使用。
        <br/> ※哈根達斯保有修改此活動的權利。
        <br/> ※兌換期間預期即自動失效，恕不提供中獎贈品，亦不更換或補發其他贈品。
        <br/> ※若未收到簡訊或有任何兌換問題請聯絡哈根達斯粉絲團。
        <br/>
        <br/> 抽獎贈品3：friDay音樂90天無限暢聽服務序號

        <br/> 參與活動並經抽獎中獎，即獲得中獎通知簡訊。依據簡訊中的指示輸入序號，即可開通。（開通期限至2019/01/31 23:59止）
        <br/>
        <br/> ※限量100份。

        <br/> ※本序號開通到期日為2019/01/31 23:59止，逾期無效。
        <br/> ※開通流程：立即點選 http://pcse.pw/fD或上網搜尋friDay音樂→點選網頁右上角『付費與軟體下載』→『付費儲值』→選擇『體驗卡』儲值→登入/加入friDay音樂會員→輸入一段式序號→勾選同意條款後確認儲值→立即享受friDay音樂90天無限聽到飽(自開通日(含)起算)
        <br/> ※本序號只限台澎金馬地區開通，本序號為單筆型序號，單筆型及免費型序號每月僅限在friDay音樂儲值兩筆(含)，第三筆以上需隔月才能進行儲值，領取記錄依friDay音樂後台資料為準。
        <br/> ※若已為friDay音樂每月續扣會員或遠傳門市手機綁約付費會員，已具有本服務正式會員無限聽全曲權利，故不適用本優惠。
        <br/> ※透過行動網路連線使用本服務，會有大量資料傳輸(傳輸費另計)，建議搭配優惠上網資費使用本服務。
        <br/> ※本服務實際支援機款，以friDay音樂網站 (https//omusic.friday.tw) 公告為準。
        <br/> ※除上述注意事項，若有於此網頁上未盡之事宜，全音樂(股)公司擁有保留修改活動內容之權利，修改訊息將於本網站上公佈，不另行通知。
        <br/> ※如有任何本音樂序號使用問題，請洽friDay音樂客服中心(02)7700-3999 (週一至週五 10:00-19:00)。
        <br/> ※請勿封鎖或過濾垃圾簡訊，簡訊是否發送成功以簡訊發送公司後台為準，將不重新發送且不以其他形式重新提供兌換網址。
        <br/> ※每一序號限兌換乙次，若誤觸開通或遺失、刪除簡訊恕不補發。
        <br/> ※序號逾期即自動失效，恕不更換或補發其他贈品。
        <br/> ※若未收到簡訊或有任何兌換問題請聯絡哈根達斯粉絲團。
        <br/>
        <br/> 抽獎贈品4：蜜桃凍飲系列買1送1優惠券

        <br/> 參與活動並經抽獎中獎，即可獲得「蜜桃凍飲系列買1送1優惠券」乙張，憑兌換券截圖至全台哈根達斯門市即享蜜桃凍飲系列買1送1優惠乙次。（兌換時間至2017/08/10）
        <br/>
        <br/> ※限量800份。

        <br/> ※內用及外帶蜜桃凍飲皆適用本活動，惟青春爵士僅限內用。
        <br/> ※買一送一限同一口味。
        <br/> ※內用蜜桃凍飲需加收以該飲品兩杯原價計算之10%服務費。
        <br/> ※圖片僅供參考，產品以現場供應為主。
        <br/> ※本活動恕不與哈根達斯禮券或其他優惠合併使用。
        <br/> ※哈根達斯保有修改此活動之權利。
        <br/> ※兌換期間預期即自動失效，恕不提供中獎贈品，亦不更換或補發其他贈品。
        <br/> ※南西店、台中遠百店、漢神店、左營二店無提供蜜桃凍飲系列。
        <br/>
        <br/> 抽獎贈品5：巴菲系列折價50元優惠券

        <br/> 參與活動並經抽獎中獎，即可獲得「巴菲系列折價50元優惠券」乙張，憑兌換券截圖至全台哈根達斯門市即可享有巴菲系列折價50元優惠乙次。（兌換時間至2017/08/10）
        <br/> ※限量2,000份。

        <br/> ※內用及外帶巴菲皆適用本活動。
        <br/> ※內用巴菲需加收以原價(含贈送餐點)計算之10%服務費。
        <br/> ※圖片僅供參考，產品以現場供應為主。
        <br/> ※本活動恕不與哈根達斯禮券或其他優惠合併使用。
        <br/> ※哈根達斯保有修改此活動之權利。
        <br/> ※南西店無提供巴菲系列。
        <br/> ※兌換期間預期即自動失效，恕不提供中獎贈品，亦不更換或補發其他贈品。
      </p>
      <h4>
        【注意事項】</h4>

      <ul>
        <li>每個哈根達斯蜜桃系列新品冰淇淋單球兌換券簡訊連結兌換期限為2018/08/10止，逾期未完成兌換者視為自動放棄中獎資格，恕不提供中獎贈品。參加人未依指示於受理期限內填寫完整資料者，亦同。中獎之連結兌換完成即失效，不得重複使用。</li>
        <li>每個Friday音樂90天無限暢聽服務序號簡訊連結兌換期限為2019/01/31止，逾期未完成兌換者視為自動放棄中獎資格，恕不提供中獎贈品。參加人未依指示於受理期限內填寫完整資料者，亦同。中獎之連結兌換完成即失效，不得重複使用。</li>
        <li>請勿封鎖或過濾垃圾簡訊，簡訊發送是否成功以簡訊發送公司留存資料為準，未發送成功者視同棄權，將不重新發送且不以其他形式重新提供中獎通知簡訊，贈品亦無法補發。</li>
        <li>抽獎資格依活動頁面注意事項內容為準，須以個人Facebook帳號登錄，並需提供參加者本人之姓名、電話、Email、地址，不得重覆登錄或冒用他人姓名、帳號或手機。如經查獲自負相關法律責任，台灣通用磨坊股份有限公司（下稱「主辦單位」）並得取消其得獎資格。</li>
        <li>本活動之獎項不得轉換、轉讓或折換現金，獎品以實物為準，網頁及各式宣傳物上之圖片僅供參考，不得折換現金。如遇產品缺貨或不可抗力之事由導致獎品內容變更，主辦單位有權變更贈品，改以等值商品取代之，得獎者不得要求折現或轉換其他商品。得獎者同意遵守各獎品供應商有關獎品之各項條款及細節，且主辦單位不負贈品之任何任何瑕疵擔保、維護或保固責任。</li>
        <li>本活動僅限設籍台灣、澎湖、金門、馬祖地區者參加，參加活動者並以擁有中華民國身分證及當地使用之手機號碼者為限。不符合參加資格者，主辦單位得取消其得獎資格。</li>
        <li>活動注意事項載明於各活動網頁中，參加人於參加活動時，請先詳閱相關活動條例規範，參加本活動即表示參加人同意接受相關活動注意事項之規範，如有違反活動注意事項及政府法令之行為，主辦單位得取消其參加或得獎資格，並對於任何破壞本活動之行為保留相關法律權利。</li>
        <li>主辦單位有權檢視本次活動中，各參加人之活動參與行為及中獎情形是否有任何破壞活動進行、破壞網站及網站管理者之運作，例如：冒用他人名義、人為操作、蓄意偽造、短時間異常多筆參與行為、透過任何電腦程式參與活動、詐欺或以任何其他不正當的方式意圖以進行不實或虛偽活動參與行為，活動參加人因上述情形所獲得之活動資格及因而中獎者，主辦單位保有取消其得獎資格的權利，並保留法律追訴權。若有違反常理或涉嫌不法之異常狀況者、或登錄資料不實或不正確，或有違反活動規範之行為，主辦單位保留變更、終止活動及審核參加人之參加活動資格的權利。</li>
        <li>如有任何因電腦、網路、電話、技術或不可歸責於主辦單位或簡訊發送公司之事由，而使系統誤送活動訊息或中獎通知，主辦單位保有取消或更正該訊息或通知的權利。若因而致參加人所寄出或登錄之資料有遲延、遺失、錯誤、無法辨識或毀損之情況，視為未中獎，主辦單位不負任何法律責任，參加人視同放棄中獎資格亦不得因此異議。</li>
        <li>主辦單位之員工、經銷商、相關配合廠商、廣告公司之員工、其配偶、家屬不得參加本活動。不符合參加資格者或違反本項不得參加規定查證屬實者，將被取消中獎資格並須退返所得獎項。</li>
        <li>主辦單位有權審核參加人之參加活動資格，除上述注意事項，各活動請參照各活動之活動說明與注意事項。主辦單位保留修改、變更或終止本活動內容之權利。各活動如有未盡事宜，主辦單位有權對本活動所有事宜作出解釋或裁決，並悉依主辦單位相關規定及解釋為準。相關訊息將於本網站上公布，不另行通知。</li>
        <li>中獎者如對領取相關程序有任何疑問，請於活動期間即日起至2018/08/10聯絡哈根達斯粉絲團，服務時間：週一至週五10:00~18:00。</li>

      </ul>

      <h4>蒐集個人資料告知及同意書</h4>
      <p>
        以下告知及同意事項，請參與本活動者於參與本活動前務必詳閱，若參加者將活動所需資料透過本活動網站輸入個人資料後並透過網路遞送參與活動，即視為已充分閱讀、瞭解並同意以下之相關事項：
        <br/> 一、告知事項：依據個人資料保護法第八條等相關規定，明列以下告知事項：
        <br/> （一）蒐集個人資料公司：台灣通用磨坊股份有限公司（下稱「主辦單位」）。
        <br/> （二）蒐集之目的：基於在台灣地區舉辦抽獎及行銷活動，參加人/中獎人之個人資料得為執行【桃憩夏日 樂響歌單】抽獎活動（下稱「本活動」）、本活動中獎者兌領、履行法定義務（如申報所得等）、委託第三人提供各種服務之需求（如委外發送簡訊）、契約、類似契約、消費者、客戶管理與服務、行銷之目的進行蒐集、處理及利用之事宜。
        <br/> （三）個人資料之類別：包括個人資料中識別類（例如：識別個人者中之姓名、生日、身份證字號、護照號碼、電話號碼、手機號碼、婚姻狀態、家庭成員、教育程度、職業、財務狀況、地址、電子郵件、臉書帳號及其他可用於辨識個人特質之資料等。具體項目則如本活動參與頁面及活動規範內所列事項。）
        <br/> （四）個人資料利用之期間：自本活動參加人授權參與本活動起始之日起至本活動結束後3個月內，但因執行上述蒐集目的所必要範圍內，不在此限。中獎人所提供中奬收據上所填載之個人基本資料，僅作為領取獎項及申報個人所得使用；主辦單位依據稅法規定相關收據最長保存7年，屆時銷毀，不移作他用。
        <br/> （五）個人資料利用之地區：本次活動僅限設籍於台灣、澎湖、金門、馬祖地區者參加，且所蒐集之個人資料將不會被移轉至台灣、澎湖、金門、馬祖以外地區。
        <br/> （六）個人資料利用之對象及方式：由主辦/協辦單位於執行本活動時之必要相關人員利用之，利用人員須依執行本活動作業所必要方式利用此個人資料。
        <br/> （七）依個人資料保護法第三條規定得行使之權利及方式：本活動參與者於身分獲確認後，得向主辦單位提出申請，以查詢、請求閱覽、請求製給複製本；或請求補充／更正、請求停止蒐集、處理、利用或請求刪除個人資料內容之一部或全部，但主辦單位為執行職務或業務所必要，或有法令規定之情況者，得予拒絕。（註：本活動參加人申請查詢、閱覽、製給複製本時，將酌收必要成本費用）。
        <br/> 二、參加本活動者將活動所需個人資料填寫後，以任何方式遞送至主辦/協辦單位收執時，均視為本活動參與者已同意提供其所遞送或輸入至活動網站之個人資料予主辦單位及協辦單位，於本活動業務往來之必要範圍內為蒐集、處理及利用。此外，本活動參與者可決定是否填寫本活動規範內所列事項之相關欄位，若本活動參與者未填寫相關欄位之一部或全部時，主辦單位將無法履行本活動內容，而將取消參加人的參加及領獎資格。
        <br/> 三、參加本活動者同意將本活動規範內所列事項之個人資料，無償提供給主辦單位及協辦單位，於本活動業務往來之必要範圍內蒐集、處理及利用。
        <br/> 四、保護本活動參與者資料之安全措施：主辦/協辦單位將依據相關法令之規定及業已構建之適當措施，保障本活動參加人/中獎人個人資料之安全。
      </p>
    </VuePerfectScrollbar>
  </div>
</div>
</template>
<script>
import store from "../store/";
import VuePerfectScrollbar from "vue-perfect-scrollbar";

export default {
  components: {
    VuePerfectScrollbar
  },
  props: {},
  data() {
    return {
      isOpen: false,
      settings: {
        maxScrollbarLength: 0
      }
    };
  },
  watch: {
    open(val) {
      if (val === true) {
        store.commit("setPage", "rule");
      }
    }
  },
  computed: {
    open: () => store.state.ui.rule_modal
  },
  created() {},
  mounted() {
    const _this = this;
    window.iframe = this.$refs.iframe;
  },
  methods: {
    scrollHanle() {},
    close() {
      store.commit("setRuleModal", false);
    }
  }
};
</script>
<style lang="scss">
.rule-modal {
  position: absolute;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  z-index: 999;
  padding: 4%;
  padding-top: calc(8% + 2em);
  opacity: 0;
  font-size: 16px;
  visibility: hidden;
  transition: 0.3s ease all;
  &.active {
    opacity: 1;
    visibility: visible;
    > .rule-content {
      animation: bounceInUp 1.2s 0s 1 both;
    }
  }
  > .rule-content {
    position: relative;
    background-color: rgba(255, 255, 255, 0.95);
    height: 100%;
    border-radius: 12px;
    padding: 2%;
    padding-right: 4%;
    z-index: 2;
    h3 {
      text-align: center;
      position: relative;
      font-size: 1.4em;
      color: rgba(204, 87, 116, 1);
      margin: 6% 0 4% 0;
      .close {
        display: block;
        position: absolute;
        top: 50%;
        right: 4%;
        width: 1.2em;
        cursor: pointer;
        transform: translate(0, -50%);
        > img {
          display: block;
          width: 100%;
        }
      }
    }
    .scroll-area {
      position: relative;
      width: 100%;
      height: 80%;
      padding: 6px;
      overflow: auto;
      .ps__scrollbar-x-rail,
      .ps__scrollbar-y-rail {
        opacity: 1;
        .ps__scrollbar-y {
          background-color: #cc5774;
        }
      }
      h4 {
        font-size: 1em;
        font-weight: bolder;
        margin: 5% 0 2% 0;
        &:first-child {
          margin-top: 0;
        }
      }
      p {
        margin: 0;
        line-height: 1.5;
        font-size: 0.7em;
      }
      ul {
        margin: 0;
        padding: 0;
        list-style: decimal;
        padding-left: 1em;
        li {
          line-height: 1.5;
          font-size: 0.8em;
          margin-bottom: 6px;
        }
      }
    }
  }
  > .blur {
    content: "";
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    z-index: 1;
    background-color: rgba(255, 255, 255, 0.4);
  }
}
</style>